export const BANK_DATA = {
    data: [
        {
            code: '中国工商银行',
            name: '中国工商银行'
        },
        {
            code: '中国农业银行',
            name: '中国农业银行'
        },
        {
            code: '中国银行',
            name: '中国银行'
        },
        {
            code: '中国建设银行',
            name: '中国建设银行'
        },
        {
            code: '交通银行',
            name: '交通银行'
        },
        {
            code: '中国邮政储蓄银行',
            name: '中国邮政储蓄银行'
        },
        {
            code: '中信银行',
            name: '中信银行'
        },
        {
            code: '中国光大银行',
            name: '中国光大银行'
        },
        {
            code: '华夏银行',
            name: '华夏银行'
        },
        {
            code: '中国民生银行',
            name: '中国民生银行'
        },
        {
            code: '广发银行股份有限公司',
            name: '广发银行股份有限公司'
        },
        {
            code: '平安银行',
            name: '平安银行'
        },
        {
            code: '招商银行',
            name: '招商银行'
        },
        {
            code: '兴业银行',
            name: '兴业银行'
        },
        {
            code: '北京银行',
            name: '北京银行'
        },
        {
            code: '天津银行',
            name: '天津银行'
        },
        {
            code: '河北银行股份有限公司',
            name: '河北银行股份有限公司'
        },
        {
            code: '邯郸市商业银行',
            name: '邯郸市商业银行'
        },
        {
            code: '邢台银行',
            name: '邢台银行'
        },
        {
            code: '张家口市商业银行',
            name: '张家口市商业银行'
        },
        {
            code: '承德银行',
            name: '承德银行'
        },
        {
            code: '沧州银行',
            name: '沧州银行'
        },
        {
            code: '廊坊银行',
            name: '廊坊银行'
        },
        {
            code: '晋商银行网上银行',
            name: '晋商银行网上银行'
        },
        {
            code: '晋城市商业银行',
            name: '晋城市商业银行'
        },
        {
            code: '内蒙古银行',
            name: '内蒙古银行'
        },
        {
            code: '包商银行股份有限公司',
            name: '包商银行股份有限公司'
        },
        {
            code: '鄂尔多斯银行',
            name: '鄂尔多斯银行'
        },
        {
            code: '大连银行',
            name: '大连银行'
        },
        {
            code: '鞍山市商业银行',
            name: '鞍山市商业银行'
        },
        {
            code: '锦州银行',
            name: '锦州银行'
        },
        {
            code: '葫芦岛银行',
            name: '葫芦岛银行'
        },
        {
            code: '营口银行',
            name: '营口银行'
        },
        {
            code: '阜新银行结算中心',
            name: '阜新银行结算中心'
        },
        {
            code: '吉林银行',
            name: '吉林银行'
        },
        {
            code: '哈尔滨银行结算中心',
            name: '哈尔滨银行结算中心'
        },
        {
            code: '龙江银行',
            name: '龙江银行'
        },
        {
            code: '上海银行',
            name: '上海银行'
        },
        {
            code: '南京银行',
            name: '南京银行'
        },
        {
            code: '江苏银行股份有限公司',
            name: '江苏银行股份有限公司'
        },
        {
            code: '苏州银行',
            name: '苏州银行'
        },
        {
            code: '江苏长江商行',
            name: '江苏长江商行'
        },
        {
            code: '杭州银行',
            name: '杭州银行'
        },
        {
            code: '宁波银行',
            name: '宁波银行'
        },
        {
            code: '温州银行',
            name: '温州银行'
        },
        {
            code: '湖州银行',
            name: '湖州银行'
        },
        {
            code: '绍兴银行',
            name: '绍兴银行'
        },
        {
            code: '浙江稠州商业银行',
            name: '浙江稠州商业银行'
        },
        {
            code: '台州银行',
            name: '台州银行'
        },
        {
            code: '浙江泰隆商业银行',
            name: '浙江泰隆商业银行'
        },
        {
            code: '浙江民泰商业银行',
            name: '浙江民泰商业银行'
        },
        {
            code: '福建海峡银行',
            name: '福建海峡银行'
        },
        {
            code: '厦门银行',
            name: '厦门银行'
        },
        {
            code: '南昌银行',
            name: '南昌银行'
        },
        {
            code: '九江银行股份有限公司',
            name: '九江银行股份有限公司'
        },
        {
            code: '赣州银行',
            name: '赣州银行'
        },
        {
            code: '上饶银行',
            name: '上饶银行'
        },
        {
            code: '齐鲁银行',
            name: '齐鲁银行'
        },
        {
            code: '青岛银行',
            name: '青岛银行'
        },
        {
            code: '齐商银行',
            name: '齐商银行'
        },
        {
            code: '枣庄银行',
            name: '枣庄银行'
        },
        {
            code: '东营市商业银行',
            name: '东营市商业银行'
        },
        {
            code: '烟台银行',
            name: '烟台银行'
        },
        {
            code: '潍坊银行',
            name: '潍坊银行'
        },
        {
            code: '济宁银行',
            name: '济宁银行'
        },
        {
            code: '泰安市商业银行',
            name: '泰安市商业银行'
        },
        {
            code: '莱商银行',
            name: '莱商银行'
        },
        {
            code: '威海市商业银行',
            name: '威海市商业银行'
        },
        {
            code: '德州银行',
            name: '德州银行'
        },
        {
            code: '临商银行',
            name: '临商银行'
        },
        {
            code: '日照银行',
            name: '日照银行'
        },
        {
            code: '郑州银行',
            name: '郑州银行'
        },
        {
            code: '开封市商业银行',
            name: '开封市商业银行'
        },
        {
            code: '洛阳银行',
            name: '洛阳银行'
        },
        {
            code: '漯河市商业银行',
            name: '漯河市商业银行'
        },
        {
            code: '商丘市商业银行',
            name: '商丘市商业银行'
        },
        {
            code: '南阳市商业银行',
            name: '南阳市商业银行'
        },
        {
            code: '汉口银行',
            name: '汉口银行'
        },
        {
            code: '长沙银行',
            name: '长沙银行'
        },
        {
            code: '广州银行',
            name: '广州银行'
        },
        {
            code: '珠海华润银行清算中心',
            name: '珠海华润银行清算中心'
        },
        {
            code: '广东华兴银行',
            name: '广东华兴银行'
        },
        {
            code: '广东南粤银行股份有限公司',
            name: '广东南粤银行股份有限公司'
        },
        {
            code: '东莞银行',
            name: '东莞银行'
        },
        {
            code: '广西北部湾银行',
            name: '广西北部湾银行'
        },
        {
            code: '柳州银行',
            name: '柳州银行'
        },
        {
            code: '桂林银行股份有限公司',
            name: '桂林银行股份有限公司'
        },
        {
            code: '成都银行',
            name: '成都银行'
        },
        {
            code: '重庆银行股份有限公司',
            name: '重庆银行股份有限公司'
        },
        {
            code: '自贡市商业银行清算中心',
            name: '自贡市商业银行清算中心'
        },
        {
            code: '攀枝花市商业银行',
            name: '攀枝花市商业银行'
        },
        {
            code: '德阳银行',
            name: '德阳银行'
        },
        {
            code: '绵阳市商业银行',
            name: '绵阳市商业银行'
        },
        {
            code: '南充市商业银行',
            name: '南充市商业银行'
        },
        {
            code: '贵阳银行',
            name: '贵阳银行'
        },
        {
            code: '富滇银行',
            name: '富滇银行'
        },
        {
            code: '西安银行',
            name: '西安银行'
        },
        {
            code: '长安银行',
            name: '长安银行'
        },
        {
            code: '兰州银行股份有限公司',
            name: '兰州银行股份有限公司'
        },
        {
            code: '青海银行',
            name: '青海银行'
        },
        {
            code: '宁夏银行',
            name: '宁夏银行'
        },
        {
            code: '乌鲁木齐市商业银行',
            name: '乌鲁木齐市商业银行'
        },
        {
            code: '昆仑银行',
            name: '昆仑银行'
        },
        {
            code: '江阴农商银行',
            name: '江阴农商银行'
        },
        {
            code: '太仓农商行',
            name: '太仓农商行'
        },
        {
            code: '昆山农村商业银行',
            name: '昆山农村商业银行'
        },
        {
            code: '吴江农村商业银行',
            name: '吴江农村商业银行'
        },
        {
            code: '常熟农村商业银行',
            name: '常熟农村商业银行'
        },
        {
            code: '张家港农村商业银行',
            name: '张家港农村商业银行'
        },
        {
            code: '广州农村商业银行',
            name: '广州农村商业银行'
        },
        {
            code: '顺德农村商业银行',
            name: '顺德农村商业银行'
        },
        {
            code: '海口联合农村商业银行',
            name: '海口联合农村商业银行'
        },
        {
            code: '重庆农村商业银行',
            name: '重庆农村商业银行'
        },
        {
            code: '恒丰银行',
            name: '恒丰银行'
        },
        {
            code: '浙商银行',
            name: '浙商银行'
        },
        {
            code: '天津农商银行',
            name: '天津农商银行'
        },
        {
            code: '渤海银行',
            name: '渤海银行'
        },
        {
            code: '徽商银行',
            name: '徽商银行'
        },
        {
            code: '北京顺义银座村镇银行',
            name: '北京顺义银座村镇银行'
        },
        {
            code: '浙江景宁银座村镇银行',
            name: '浙江景宁银座村镇银行'
        },
        {
            code: '浙江三门银座村镇银行',
            name: '浙江三门银座村镇银行'
        },
        {
            code: '江西赣州银座村镇银行',
            name: '江西赣州银座村镇银行'
        },
        {
            code: '深圳福田银座村镇银行',
            name: '深圳福田银座村镇银行'
        },
        {
            code: '重庆渝北银座村镇银行',
            name: '重庆渝北银座村镇银行'
        },
        {
            code: '重庆黔江银座村镇银行',
            name: '重庆黔江银座村镇银行'
        },
        {
            code: '上海农村商业银行',
            name: '上海农村商业银行'
        },
        {
            code: '北京农村商业银行',
            name: '北京农村商业银行'
        },
        {
            code: '吉林农村信用社',
            name: '吉林农村信用社'
        },
        {
            code: '江苏省农村信用社联合社',
            name: '江苏省农村信用社联合社'
        },
        {
            code: '浙江省农村信用社',
            name: '浙江省农村信用社'
        },
        {
            code: '鄞州银行',
            name: '鄞州银行'
        },
        {
            code: '安徽省农村信用社联合社',
            name: '安徽省农村信用社联合社'
        },
        {
            code: '福建省农村信用社',
            name: '福建省农村信用社'
        },
        {
            code: '山东省农联社',
            name: '山东省农联社'
        },
        {
            code: '湖北农信',
            name: '湖北农信'
        },
        {
            code: '深圳农商行',
            name: '深圳农商行'
        },
        {
            code: '东莞农村商业银行',
            name: '东莞农村商业银行'
        },
        {
            code: '广西农村信用社（合作银行）',
            name: '广西农村信用社（合作银行）'
        },
        {
            code: '海南省农村信用社',
            name: '海南省农村信用社'
        },
        {
            code: '云南省农村信用社',
            name: '云南省农村信用社'
        },
        {
            code: '黄河农村商业银行',
            name: '黄河农村商业银行'
        },
        {
            code: '东亚银行',
            name: '东亚银行'
        },
        {
            code: '外换银行（中国）有限公司',
            name: '外换银行（中国）有限公司'
        },
        {
            code: '友利银行',
            name: '友利银行'
        },
        {
            code: '新韩银行中国',
            name: '新韩银行中国'
        },
        {
            code: '企业银行',
            name: '企业银行'
        },
        {
            code: '韩亚银行',
            name: '韩亚银行'
        },
        {
            code: '中原银行股份有限公司',
            name: '中原银行股份有限公司'
        },
        {
            code: '湖北银行股份有限公司',
            name: '湖北银行股份有限公司'
        }]

};
export default BANK_DATA

